import 'package:flutter/material.dart';

import '../../../../core/utils/build_section.dart';

class CarolsBody extends StatelessWidget {
  const CarolsBody({super.key});

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: ListView(
        padding: const EdgeInsets.all(16),
        children: [
          BuildSection(
            title: "امسك يارب إيدى",
            content: """
        + امسك يارب إيدى                   زى بطرس زمان

لما قرب يغرق                        مسكت ايديه بحنان

(ورفعته وسط الموج                  واديته سلام وأمان)2

وأنا زيه ياربى                       امسك ايدى كمان

+ الموج عليا عالى                    يخطف قلبى منى

والريح يارب شديدة                   وخايف نفسى تخونى

(والمركب طالع نازل                 وصخور بتحطمنى)2

قول للموج يهدأ              وفى صدرك احضنى


+ إيمانى يارب ضعيف               شددنى فى الإيمان

ان يوم انا شكيت فيك                 أو تهت فى أى مكان

(ده أنت يارب أبويا                   قلبك كله حنان)2

رجعنى تانى ليك            أعيش طول الزمان
               """,
          ),
          BuildSection(
            title: "ثبت أنظارك فيه",
            content: """ 
         ثبت أنظارك فيه وحمولك سيبها عليه)2
(وفي وادي ظل الموت)2 (إرفع عينك تلاقيه)2

1- (إن كنت سمعت نداه ع الميه مشيت وياه)2
(ليه تتلفت حواليك)2 (عينك خليها عليه)2

2- (إن شفت بعينك نار صدق يطفيها البار)2
(أو جواها يمشيك)2 (زي الفتيان حواليه)2
              """,
          ),
          BuildSection(
            title: "إسمع صراخى يا سيدي",
            content: """ 
            إسمع صراخى يا سيدي 
وإلى صلاتى أمل أذنيك

(ارحمنى وأمسك بيدى)2 
(فأنا فى حاجة شديدة إليك)2

ها قد أعيت فى نفسي 
من ضيقي أدعوك يا ربي 

(وأنت وحدك أذكرك)2 
(لأنك شبع قلبي)2


صلى يونان من جوف الحوت 
أصدرت أمراً آلا يموت

(من جوف الهاوية صرخ)2 
(وبالمراحم سمعت الصوت)2
              """,
          ),
          BuildSection(
            title: "الرَبُّ قَرِيبٌ لِمَنْ يَدْعُوه",
            content: """ 
الرَبُّ قَرِيبٌ لِمَنْ يَدْعُوهْ
لَيْسَ بَعِيدًا كَمَا زَعَمُوْا
لَيْسَ غَرِيبًا عَنْ كُلِّ مَا قَاسُوهْ


فَهُوَ الذِيْ دَعَا جَمِيعَ المُتْعَبِيْن
لِيُرِيْحَهُمْ مِنْ حِمْلٍ ثَقِيلْ
لِيَمْسَح دَمْعَةً عَنْ كُلِّ قَلْبٍ حَزِيْن


(1) أوَ لَمْ يَعِيشَ هَارِبَاً
أمَا تَأَلَّمَ مُجَرَّبَاً
أوَ لَمْ يَقُومَ وَاهِبَاً لَنَا الحَيَاةْ


كَانَ مُحِبَّ العَشَّارِينْ
مُلَازِمَاً لِصَيَّادِينْ
سَاتِرَاً لِخَاطِئِينْ
مِثْلِيْ أَنَا


(2) فَكَيْفَ لَا أَثِقُ بِهِ
أَشُكُّ فِيْ حُبِّهِ
رَبِّي الَذِيْ أَحَبَّنِيْ إِلَى المَمَاتْ
               """,
          ),
          BuildSection(
            title: "يا صاحب الحنان",
            content: """ 
            يا صاحب الحنان يا ملجأ نفسي أنت هو الضَّمان في وسط غُربتي
(أحتَاجُ إليك)*2 أحتاجُ منك قوَّة لترفعني
(أنت وحدك)*2 أنت تُعين ضعفي   وترحمني
(يا سيِّدي إنِّي أريد العمق فيك فارويني وأحيني،
 إنّي أريد نور حبَّك يسطع في داخلي)*2
القرار- يا صاحب الحنان ها صرختي إليك إنِّي إليك راجعٌ راجعٌ  إليك
(راجعٌ لحضنك راجعٌ لدربك أنا راجعٌ لنورك يا صاحب الحنان)*2
                """,
          ),
          BuildSection(
            title: "علمني أنتظرك يا رب",
            content: """  
             1.	علمني ... (أنتظرك يا رب)2	 	 	 	عرفني ... (رؤيتك للدرب)2
 	(فليس لي سواك أنت سندي	 	 	 	وروحك يقودني وكلامك سراجي)2
 	 	 	 	 	 
2.	لذذني ... (بحبك الغني)2	 	 	 	وقدني ... (بنورك السني)2
 	(فحبك أعظم طوق للنجاة	 	 	 	نبع رجايا في الصلاة كل أمالي في الحياة)2
              """,
          ),
          BuildSection(
            title: "ڤول إيڤول كو إيڤول",
            content: """  
           ڤول إيڤول كو إيڤول
أريسين خورين نان إفنوتي
إن نين بارابطوما: ني إيتان
آيتو خين بين أواوش نيم ني إيتان
آيتو خين بين أوأوش أن. ني إيتان
آيتو خين أو إيمي نيم ني إيتان
آيتو خين أو ميت آتئيمي ني إتهيب
نيم ني إثؤو أونه إيڤول إبشويس
إيك إيكاف نان إيڤول.     """,
          ),
        ],
      ),
    );
  }

}
