import 'package:flutter/material.dart';
import '../../../../core/utils/build_section.dart';

class SaversBody extends StatelessWidget {
  const SaversBody({super.key});

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
        child: ListView(
          padding: const EdgeInsets.all(16),
          children: [
            BuildSection(
              title: "المزمور الثالث",
              content: """
              يا رب لماذا كثر الذين يحزنونني، كثيرون قاموا علي. كثيرون يقولون لنفسي، ليس له خلاص بإلهه. أنت يا رب أنت هو ناصري، مجدي ورافع رأسي. بصوتي إلى الرب صرخت. فاستجاب لي من جبل قدسه.

أنا اضطجعت ونمت، ثم استيقظت لأن الرب ناصري. فلا أخاف من ربوات الجموع المحيطين بي القائمين على. قم يا رب خلصني يا إلهي، لأنك ضربت كل من يعاديني باطلا. أسنان الخطاة سحقتها. للرب الخلاص وعلى شعبه بركته. هلليلويا
              """,
            ),
            BuildSection(
              title: "المزمور السادس",
              content: """ 
              يا رب لا تبكتني بغضبك، ولا تؤدبني بسخطك. ارحمني يا رب فإني ضعيف، اشفني يا رب فإن عظامي قد اضطربت ونفسي قد انزعجت جدا. وأنت يا رب فإلي متى؟ عد ونج نفسي، وأحيني من أجل رحمتك. لأنه ليس في الموت من يذكرك ولا في الجحيم من يعترف لك. تعبت في تنهدي. أعوم كل ليلة سريري، وبدموعي أبل فراشي. تعكرت من الغضب عيناي. شاخت من سائر أعدائي .

ابعدوا عنى يا جميع فاعلي الإثم. لأن الرب قد سمع صوت بكائي. الرب سمع تضرعي، الرب لصلاتي قبل، فليَخزَ وليضطرب جدا جميع أعدائي، وليرتدوا إلى ورائهم بالخزي سريعا جدا. هلليلويا.
              """,
            ),
            BuildSection(
              title: "المزمور الثاني عشر",
              content: """ 
              إلى متى يا رب تنساني؟ إلى الانقضاء؟ حتى متى تصرف وجهك عنى؟ إلى متى أردد هذه المشورات في نفسي، وهذه الأوجاع في قلبي النهار كله؟ إلى متى يرتفع عدوى علي؟ انظر واستجب لي يا ربي وإلهي. أنر عيني لئلا أنام نوم الموت، لئلا يقول عدوي: إني قد قويت عليه. الذين يحزنونني يتهللون إن أنا زللت. أما أنا فعلى رحمتك توكلت.  يبتهج قلبي بخلاصك. أسبح الرب المحسنَ إلي، وأرتل لاسم الرب العلي. هلليلويا.
              """,
            ),
            BuildSection(
              title: "إنجيل متى 25: 1-13",
              content: """ 
              حينئذٍ، يشبه ملكوت السموات عشر عذارى أخذن مصابيحهن وخرجن لاستقبال العريس. خمس منهن كن جاهلات وخمس حكيمات. فأخذت الجاهلات مصابيحَهن ولم يأخذن معهن زيتا. وأما الحكيمات فأخذن زيتا في آنيتهن مع مصابيحهن. ولما أبطأ العريس نعسن كلهن ونمن. ولما انتصف الليل صار صراخ: هوذا العريس قد أقبل فقمن وأخرجن للقائه. حينئذ قامت أولئك العذارى جميعا وزينَّ مصابيحهن. فقالت الجاهلات للحكيمات أعطيننا من زيتكن فإن مصابيحنا تنطفئ. فأجابت الحكيمات قائلات: لعله لا يكفينا وإياكن، فاذهبن بالحري إلى الباعة وابتعن لكن. فلما ذهبن ليبتعن جاء العريس والمستعدات دخلن معه إلى العرس وأغلِق الباب. وأخيرا جاءت بقية العذارى أيضا قائلات: ربنا ربنا افتح لنا. أما هو فأجاب وقال: الحق أقول لكن إني لا أعرفكن. فاسهروا إذن لأنكم لا تعرفون اليوم ولا الساعة التي يأتي فيها ابن الإنسان (والمجد لله دائمًا).
              """,
            ),
            BuildSection(
              title: "القطع",
              content: """ 
              ها هو ذا العريس يأتي في نصف الليل، طوبى للعبد الذي يجده مستيقظا. أما الذي يجده متغافلا، فإنه غير مستحق المضي معه. فانظري يا نفسي لئلا تثقلي نوما، فتلقي خارج الملكوت. بل اسهري واصرخي قائلة: قدوس قدوس قدوس أنت يا الله، من أجل والدة الإله ارحمنا (ذوكصابتري كيه إيو كي آجيو ابنيفماتي  المجد للآب والابن والروح القدس).

تفهمي يا نفسي ذلك اليومَ الرهيب واستيقظي، وأضيئي مصباحك بزيت البهجة. لأنك لا تعلمين متى يأتي نحوك الصوت القائل: ها هو ذا العريس قد أقبل. فانظري يا نفسي لا تنعسي، لئلا تقفي خارجا قارعة مثل الخمس العذارى الجاهلات، بل اسهري متضرعة لكي تلتقي المسيح الرب بدهن دسم، وينعم عليك بعرس مجده الإلهي الحقيقي (كي نين، كي آ إي، كي ايستوس إي أوناس تون إي أونون آمين - الآن وكل أوان وإلى دهر الداهرين آمين).

أنت هي سور خلاصنا يا والدة الإله العذراء الحصن المنيع غير المنثلم أبطلي مشورة المعاندين، وحزن عبيدك رديه إلى فرح وحصني مدينتنا (ديرنا) وعن ملوكنا (رؤسائنا) حاربي، وتشفعي عن سلام العالم، لأنك أنت هي رجاؤنا يا والدة الإله (كي نين، كي آ إي، كي ايستوس إي أوناس تون إي أونون آمين الآن وكل أوان وإلى دهر الداهرين آمين)
              """,
            ),
            BuildSection(
              title: "الرسالة إلى العبرانيين ١",
              content: """  
              1 اَللهُ، بَعْدَ مَا كَلَّمَ الآبَاءَ بِالأَنْبِيَاءِ قَدِيمًا، بِأَنْوَاعٍ وَطُرُق كَثِيرَةٍ،
2 كَلَّمَنَا فِي هذِهِ الأَيَّامِ الأَخِيرَةِ فِي ابْنِهِ، الَّذِي جَعَلَهُ وَارِثًا لِكُلِّ شَيْءٍ، الَّذِي بِهِ أَيْضًا عَمِلَ الْعَالَمِينَ،
3 الَّذِي، وَهُوَ بَهَاءُ مَجْدِهِ، وَرَسْمُ جَوْهَرِهِ، وَحَامِلٌ كُلَّ الأَشْيَاءِ بِكَلِمَةِ قُدْرَتِهِ، بَعْدَ مَا صَنَعَ بِنَفْسِهِ تَطْهِيرًا لِخَطَايَانَا، جَلَسَ فِي يَمِينِ الْعَظَمَةِ فِي الأَعَالِي،
4 صَائِرًا أَعْظَمَ مِنَ الْمَلاَئِكَةِ بِمِقْدَارِ مَا وَرِثَ اسْمًا أَفْضَلَ مِنْهُمْ.
5 لأَنَّهُ لِمَنْ مِنَ الْمَلاَئِكَةِ قَالَ قَطُّ: «أَنْتَ ابْنِي أَنَا الْيَوْمَ وَلَدْتُكَ»؟ وَأَيْضًا: «أَنَا أَكُونُ لَهُ أَبًا وَهُوَ يَكُونُ لِيَ ابْنًا»؟
6 وَأَيْضًا مَتَى أَدْخَلَ الْبِكْرَ إِلَى الْعَالَمِ يَقُولُ: «وَلْتَسْجُدْ لَهُ كُلُّ مَلاَئِكَةِ اللهِ».
7 وَعَنِ الْمَلاَئِكَةِ يَقُولُ: «الصَّانِعُ مَلاَئِكَتَهُ رِيَاحًا وَخُدَّامَهُ لَهِيبَ نَارٍ».
8 وَأَمَّا عَنْ الابْنِ: «كُرْسِيُّكَ يَا أَللهُ إِلَى دَهْرِ الدُّهُورِ. قَضِيبُ اسْتِقَامَةٍ قَضِيبُ مُلْكِكَ.
9 أَحْبَبْتَ الْبِرَّ وَأَبْغَضْتَ الإِثْمَ. مِنْ أَجْلِ ذلِكَ مَسَحَكَ اللهُ إِلهُكَ بِزَيْتِ الابْتِهَاجِ أَكْثَرَ مِنْ شُرَكَائِكَ».
10 وَ «أَنْتَ يَا رَبُّ فِي الْبَدْءِ أَسَّسْتَ الأَرْضَ، وَالسَّمَاوَاتُ هِيَ عَمَلُ يَدَيْكَ.
11 هِيَ تَبِيدُ وَلكِنْ أَنْتَ تَبْقَى، وَكُلُّهَا كَثَوْبٍ تَبْلَى،
12 وَكَرِدَاءٍ تَطْوِيهَا فَتَتَغَيَّرُ. وَلكِنْ أَنْتَ أَنْتَ، وَسِنُوكَ لَنْ تَفْنَى».
13 ثُمَّ لِمَنْ مِنَ الْمَلاَئِكَةِ قَالَ قَطُّ: «اجْلِسْ عَنْ يَمِينِي حَتَّى أَضَعَ أَعْدَاءَكَ مَوْطِئًا لِقَدَمَيْكَ»؟
14 أَلَيْسَ جَمِيعُهُمْ أَرْوَاحًا خَادِمَةً مُرْسَلَةً لِلْخِدْمَةِ لأَجْلِ الْعَتِيدِينَ أَنْ يَرِثُوا الْخَلاَصَ

              """,
            ),
          ],
        ),
    );
  }

}
